In [1]:
import pandas as pd

In [2]:
col_names = ['age', 'workclass', 'fnlwgt', 'education', 'education-num', 'marital_status',
             'occupation', 'relationship', 'race', 'sex', 'capital_gain',
             'capital_loss', 'hours_per_week', 'native_country', 'income']

In [3]:
df = pd.read_csv('data/adult.data', header=None)
df.columns = col_names
df.head()

,age,workclass,fnlwgt,education,education-num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         32561 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education-num     32561 non-null int64
marital_status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital_gain      32561 non-null int64
capital_loss      32561 non-null int64
hours_per_week    32561 non-null int64
native_country    32561 non-null object
income            32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [5]:
def clean_set(df, name):
    unique = [str(x).strip() for x in df[name].unique()]
    unique = sorted(unique)
    
    return dict(zip(unique, range(len(unique))))

In [6]:
workclass = clean_set(df, 'workclass')
education = clean_set(df, 'education')
marital_status = clean_set(df, 'marital_status')
occupation = clean_set(df, 'occupation')
relationship = clean_set(df, 'relationship')
race = clean_set(df, 'race')
sex = clean_set(df, 'sex')
native_country = clean_set(df, 'native_country')
income = clean_set(df, 'income')

In [7]:
#clean up

df['workclass'] = df.workclass.apply(lambda x: workclass[str(x).strip()])
df['education'] = df.education.apply(lambda x: education[str(x).strip()])
df['marital_status'] = df.marital_status.apply(lambda x: marital_status[str(x).strip()])
df['occupation'] = df.occupation.apply(lambda x: occupation[str(x).strip()])
df['relationship'] = df.relationship.apply(lambda x: relationship[str(x).strip()])
df['race'] = df.race.apply(lambda x: race[str(x).strip()])
df['sex'] = df.sex.apply(lambda x: sex[str(x).strip()])
df['native_country'] = df.native_country.apply(lambda x: native_country[str(x).strip()])
df['income'] = df.income.apply(lambda x: income[str(x).strip()])

In [8]:
income

{'<=50K': 0, '>50K': 1}

In [9]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,7,77516,9,13,4,1,1,4,1,2174,0,40,39,0
1,50,6,83311,9,13,2,4,0,4,1,0,0,13,39,0
2,38,4,215646,11,9,0,6,1,4,1,0,0,40,39,0
3,53,4,234721,1,7,2,6,0,2,1,0,0,40,39,0
4,28,4,338409,9,13,2,10,5,2,0,0,0,40,5,0

In [10]:
out_file = 'data/train.csv'
df.to_csv(out_file, index=False, header=False)